In [1]:
import os
import pandas as pd

In [2]:
data_dir = r"C:\Users\diogo\OneDrive\Documents\Dev\Creating\Projetos\Python\Python Dashboard Equal\excel_data"

cols_by_archive = {}
for archive in os.listdir(data_dir):
    if archive[:5] == "clean":
        df = pd.read_excel(f"{data_dir}\\{archive}")
        cols_by_archive[archive] = df.columns.to_list()
        
print(cols_by_archive)

{'clean_dim_familia_produtos.xlsx': ['codigo_familia', 'descricaofamilia'], 'clean_dim_produtos.xlsx': ['codigo_produto', 'descricaoproduto', 'codigo_familia', 'custo_produto_unitario'], 'clean_dim_vendedor.xlsx': ['codigo_vendedor', 'nome_vendedor'], 'clean_fato_vendas.xlsx': ['codigo_contrato', 'data_venda', 'codigo_produto', 'filial_venda', 'quantidade', 'valor_monetario_total', 'valor_desconto', 'codigo_vendedor', 'codigo_cliente']}

In [3]:
data_dir = r"C:\Users\diogo\OneDrive\Documents\Dev\Creating\Projetos\Python\Python Dashboard Equal\excel_data"
df_fato_vendas = pd.read_excel(f"{data_dir}\\clean_fato_vendas.xlsx")
df_dim_vendedor = pd.read_excel(f"{data_dir}\\clean_dim_vendedor.xlsx")
df_dim_produtos = pd.read_excel(f"{data_dir}\\clean_dim_produtos.xlsx")
df_dim_familia_produtos = pd.read_excel(f"{data_dir}\\clean_dim_familia_produtos.xlsx")

In [4]:
df_sales = pd.merge(df_dim_vendedor, df_fato_vendas[['data_venda', 'codigo_produto', 'filial_venda', 'quantidade', 'valor_monetario_total', 'codigo_vendedor']], on="codigo_vendedor", how="inner")
display(df_sales.head())

,codigo_vendedor,nome_vendedor,data_venda,codigo_produto,filial_venda,quantidade,valor_monetario_total
0,605,Laura Carpenter,2023-03-21,2389701,11,1,13000.00
1,605,Laura Carpenter,2022-03-25,1125100,11,1,8549.05
2,605,Laura Carpenter,2022-07-06,2070200,11,10,4990.00
3,605,Laura Carpenter,2022-01-24,2351300,11,1,4162.00
4,605,Laura Carpenter,2023-12-19,2984400,11,1,4104.00

In [8]:
df_sales["data_venda"] = pd.to_datetime(df_sales["data_venda"])
df_sales["mes"] = df_sales["data_venda"].dt.month
df_sales["ano"] = df_sales["data_venda"].dt.year
display(df_sales)

,codigo_vendedor,nome_vendedor,data_venda,codigo_produto,filial_venda,quantidade,valor_monetario_total,mes,ano
0,605,Laura Carpenter,2023-03-21,2389701,11,1,13000.00,3,2023
1,605,Laura Carpenter,2022-03-25,1125100,11,1,8549.05,3,2022
2,605,Laura Carpenter,2022-07-06,2070200,11,10,4990.00,7,2022
3,605,Laura Carpenter,2022-01-24,2351300,11,1,4162.00,1,2022
4,605,Laura Carpenter,2023-12-19,2984400,11,1,4104.00,12,2023
...,...,...,...,...,...,...,...,...,...
519764,590,Steven Lewis,2023-01-12,400,14,1,0.01,1,2023
519765,590,Steven Lewis,2023-02-09,1360100,14,1,0.01,2,2023
519766,590,Steven Lewis,2023-01-12,589800,14,2,0.00,1,2023
519767,590,Steven Lewis,2023-01-12,255100,14,1,0.00,1,2023
519768,590,Steven Lewis,2023-02-09,2524900,14,1,0.00,2,2023

In [5]:
df_sales.to_excel(f"{data_dir}\\df_saleBranch.xlsx", index=False)

In [7]:
print(df_sales.shape)

(519769, 7)